#include "file_handler.hpp"

int main() {
<<<<<<< Updated upstream
    setlocale(LC_ALL, "en_RU.UTF-8");
    printf("ÐÐ°Ð·Ð½Ð°Ñ‡ÐµÐ½Ð¸Ðµ Ð¿Ñ€Ð¾Ð³Ñ€Ð°Ð¼Ð¼Ñ‹: Ð¡Ð¾Ð·Ð´Ð°Ð½Ð¸Ðµ Ñ„Ð°Ð¹Ð»Ð¾Ð² Ð½Ð° Ð¾ÑÐ½Ð¾Ð²Ðµ ÑÐ²ÐµÐ´ÐµÐ½Ð¸Ð¹, Ð²Ð²Ð¾Ð´Ð¸Ð¼Ñ‹Ñ… Ð¿Ð¾Ð»ÑŒÐ·Ð¾Ð²Ð°Ñ‚ÐµÐ»ÐµÐ¼\n");
    printf("Ð§Ñ‚Ð¾ Ñ‚Ñ€ÐµÐ±ÑƒÐµÑ‚ÑÑ Ð·Ð°Ð¿Ð¸ÑÐ°Ñ‚ÑŒ?\n1) Ð¤Ð°Ð¹Ð» Ð°Ð²Ñ‚Ð¾Ð¼Ð¾Ð±Ð¸Ð»ÑŒÐ½Ñ‹Ñ… ÑÐ²ÐµÐ´ÐµÐ½Ð¸Ð¹\n2) Ð¤Ð°Ð¹Ð» Ñ€ÐµÐ³Ð¸ÑÑ‚Ñ€Ð°Ñ†Ð¸Ð¾Ð½Ð½Ñ‹Ñ… ÑÐ²ÐµÐ´ÐµÐ½Ð¸Ð¹\n");
    printf("q) Ð”Ð»Ñ Ð·Ð°Ð²ÐµÑ€ÑˆÐµÐ½Ð¸Ñ Ð¿Ñ€Ð¾Ð³Ñ€Ð°Ð¼Ð¼Ñ‹ Ð½Ð°Ð¶Ð¼Ð¸Ñ‚Ðµ q.\n");
    char input;
    while ((input = getchar()) != EOF) {
        clear_stdin();
=======
    setlocale(LC_ALL, "rus_rus.1251");
    printf("Íàçíà÷åíèå ïðîãðàììû: Ñîçäàíèå ôàéëîâ íà îñíîâå ñâåäåíèé, ââîäèìûõ ïîëüçîâàòåëåì\n");
    printf("×òî òðåáóåòñÿ çàïèñàòü?\n1) Ôàéë àâòîìîáèëüíûõ ñâåäåíèé\n2) Ôàéë ðåãèñòðàöèîííûõ ñâåäåíèé\n");
    char input='\0';
    while (scanf("%c", &input) != EOF) {
        fseek(stdin, 0, SEEK_END);
>>>>>>> Stashed changes
        if (input == '1' || input == '2') {
            if (input == '1') write_car_data();
            else 
            if (input == '2') write_license_data();
<<<<<<< Updated upstream
        } else if (input == 'q' || input == 'Q') {
            break;
        }
        else printf("Ð”Ð°Ð½Ð½Ð¾Ð¹ Ð¾Ð¿Ñ†Ð¸Ð¸ Ð½Ðµ ÑÑƒÑ‰ÐµÑÑ‚Ð²ÑƒÐµÑ‚.\n");

        printf("Ð–ÐµÐ»Ð°ÐµÑ‚Ðµ Ð¿Ñ€Ð¾Ð´Ð¾Ð»Ð¶Ð¸Ñ‚ÑŒ Ð·Ð°Ð¿Ð¸ÑÑŒ? (enter=Ð”Ð°/N=ÐÐµÑ‚)\n");
        input = getchar();
        if (input == 'N' || input == 'n') {
            break;
        } else
        if (input == '\n') {
            printf("Ð’Ð²ÐµÐ´ÐµÐ½ enter, Ð¿Ñ€Ð¾Ð³Ñ€Ð°Ð¼Ð¼Ð° Ð¿Ñ€Ð¾Ð´Ð¾Ð»Ð¶Ð°ÐµÑ‚ Ñ€Ð°Ð±Ð¾Ñ‚Ñƒ\n");
        } else printf("Ð’Ð²ÐµÐ´ÐµÐ½ %c, Ð¿Ñ€Ð¾Ð³Ñ€Ð°Ð¼Ð¼Ð° Ð¿Ñ€Ð¾Ð´Ð¾Ð»Ð¶Ð°ÐµÑ‚ Ñ€Ð°Ð±Ð¾Ñ‚Ñƒ\n", input);

        printf("Ð§Ñ‚Ð¾ Ñ‚Ñ€ÐµÐ±ÑƒÐµÑ‚ÑÑ Ð·Ð°Ð¿Ð¸ÑÐ°Ñ‚ÑŒ?\n1) Ð¤Ð°Ð¹Ð» Ð°Ð²Ñ‚Ð¾Ð¼Ð¾Ð±Ð¸Ð»ÑŒÐ½Ñ‹Ñ… ÑÐ²ÐµÐ´ÐµÐ½Ð¸Ð¹\n2) Ð¤Ð°Ð¹Ð» Ñ€ÐµÐ³Ð¸ÑÑ‚Ñ€Ð°Ñ†Ð¸Ð¾Ð½Ð½Ñ‹Ñ… ÑÐ²ÐµÐ´ÐµÐ½Ð¸Ð¹\n");
        printf("q) Ð”Ð»Ñ Ð·Ð°Ð²ÐµÑ€ÑˆÐµÐ½Ð¸Ñ Ð¿Ñ€Ð¾Ð³Ñ€Ð°Ð¼Ð¼Ñ‹ Ð½Ð°Ð¶Ð¼Ð¸Ñ‚Ðµ q.\n");
    }
    printf("ÐÐ°Ð¶Ð¼Ð¸Ñ‚Ðµ Ð»ÑŽÐ±ÑƒÑŽ ÐºÐ»Ð°Ð²Ð¸ÑˆÑƒ Ð´Ð»Ñ Ð·Ð°Ð²ÐµÑ€ÑˆÐµÐ½Ð¸Ñ Ð¿Ñ€Ð¾Ð³Ñ€Ð°Ð¼Ð¼Ñ‹...");
=======
            printf("Æåëàåòå ïðîäîëæèòü çàïèñü? (enter=Äà/N=Íåò)\n");
            input = getchar();
            fseek(stdin, 0, SEEK_END);
            if (input == 'N' || input == 'n') {
                break;
            } else
            if (input == '\n') {
                continue;
            } else printf("Ââåäåí %c ïðîãðàììà ïðîäîëæàåò ðàáîòó\n", input);
        } else {
            printf("Ââåäåí %c. Ìîæíî ââåñòè òîëüêî îïöèþ 1 èëè îïöèþ 2. Ïîïðîáóéòå åùå ðàç.\n", input);
        }
        printf("×òî òðåáóåòñÿ çàïèñàòü?\n1) Ôàéë àâòîìîáèëüíûõ ñâåäåíèé\n2) Ôàéë ðåãèñòðàöèîííûõ ñâåäåíèé\n");
    }
    printf("Íàæìèòå ëþáóþ êëàâèøó äëÿ çàâåðøåíèÿ ïðîãðàììû...");
>>>>>>> Stashed changes
    scanf("%c", &input);
    printf("ÐŸÑ€Ð¾Ð³Ñ€Ð°Ð¼Ð¼Ð° Ð·Ð°Ð²ÐµÑ€ÑˆÐµÐ½Ð°.\n");
    return 0;
}
